graph main_graph (
  %onnx::Gemm_0[INT8, 1x13], exponents: [-7]
) initializers (
  %network.0.bias[INT32, 128]
  %network.3.bias[INT32, 64]
  %network.6.bias[INT32, 32]
  %network.6.weight[INT8, 1x1x64x32]
  %network.8.weight[INT8, 1x1x32x1]
  %network.8.bias[INT32, 1]
  %network.0.weight[INT8, 1x1x13x128]
  %network.3.weight[INT8, 1x1x128x64]
) {
  %/network/network.1/Relu_output_0 = Gemm[activation = 'Relu', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%onnx::Gemm_0, %network.0.weight, %network.0.bias)
  %/network/network.4/Relu_output_0 = Gemm[activation = 'Relu', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%/network/network.1/Relu_output_0, %network.3.weight, %network.3.bias)
  %/network/network.7/Relu_output_0 = Gemm[activation = 'Relu', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%/network/network.4/Relu_output_0, %network.6.weight, %network.6.bias)
  %15 = Gemm[activation = 'Linear', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%/network/network.7/Relu_output_0, %network.8.weight, %network.8.bias)
  return %15
}


initializers value:
%network.0.bias, shape: [128], exponents: [-13], docString: layout ==> UNK, 
value: array([ -750,   860,  1981, -2139, -1172,  -221, -1132,  1878,  1220,
        2118,  1990,  1083, -1767,  1593, -2461,   743,  -277,  -969,
         765, -2740,  1589, -1556,  1991,  -212,  -274,  -186,  -965,
       -1249,  1432, -1293,   955,  1015,    64,  1343,   653,  1021,
         163,   370,  2132,  1800,   542,   794,   810, -2225, -1272,
         361,   211,  1820, -1535,  1175, -1612,  -129,  1653,  -942,
        -621,  1830,  -445, -1247,   793,  1991,  -993,   757,  1821,
       -1928,   229, -1163, -1267,  1550,  1915,  -587,   666,  -621,
        -384,  1762,  -888,   426,  1335,  1087,  1129,   779,   988,
        2428,  1962,    27, -1378, -1637, -1560, -1303,  -727, -1291,
         333, -1061,  1540,  1413,   246,   313, -2325,   261,   487,
        1878,  1204,   836,  -742,    46,   957,  -266,   172, -1531,
        -395,  1648,   526, -2139,  1207,  -887,   149,  1997,   588,
       -2015,  -630, -1449, -1904,  -509,   687, -1153,  -397,   874,
        1461, -1421])
%network.3.bias, shape: [64], exponents: [-16], docString: layout ==> UNK, 
value: array([13126, 16049, 12560, 15450, 17560, 15607, 14069, 19096, 19522,
       12604, 19114, 13296, 18807, 15614, 13214, 18255, 15524, 18417,
       19633, 15822, 20625, 16347, 18139, 15801, 13038, -4470, 16995,
        9936, 18317, 17430, 10695, 17277, -5943, 16705, 15039, 16296,
       14654, 12412, 15717, 14665, 12453,  -736, 15442, -4662, 20067,
       15294, 13705, -4334, 16883, 19989, 12942, 18369, 17249, 13734,
       17116, 17673, -4488, 18879, 19908, 12721, 17670, 13549, 19281,
       13115])
%network.6.bias, shape: [32], exponents: [-14], docString: layout ==> UNK, 
value: array([ -529, 16336, 18697, 17119, -1167, -1710, 15084, 16754, 16554,
        -939, 17004,   307, 16651, 15940, 17831, 18800, 18553,  1270,
       20427, -2275, 18485, 20786, -1262, 16992,  -377, 19953, 13078,
       14576, 27705,  1901, 17361,   668])
%network.6.weight, shape: [1, 1, 64, 32], exponents: [-7], docString: layout ==> N16HWC16, 
value: array([ -12,   25,   32,   32,    8,   -8,   23,   22,   27,   11,   39,
        -18,   24,   22,   28,   33,    2,    7,   11,   16,  -18,   -5,
         28,    2,   10,   10,   14,    7,   11,   22,   26,   13,    1,
         28,   18,    0,  -16,    6,   29,   15,    5,   -5,   15,  -17,
         -1,   29,    5,   12,    0,   19,   12,    9,    3,   -4,   20,
         24,    4,  -17,   15,    6,   15,    8,   20,    5,  -13,    5,
         14,    3,    7,   -7,   21,   -1,   18,  -13,   13,  -15,    2,
         20,   12,    7,   13,   11,   11,   11,    1,    8,   10,   12,
         11,   -9,   39,    5,   24,   31,   35,   16,   -2,   12,   29,
         16,    0,   -8,    9,   26,   12,   -9,   10,   -2,    3,   28,
         25,   10,    8,   11,    8,    9,  -14,  -12,   13,   20,    8,
          5,    4,   -1,    6,   16,   -3,    6,    8,    4,   19,   13,
        -12,    0,   28,   27,    6,    3,   13,   -5,   22,   16,   24,
         14,   -8,   13,   13,   13,  -15,    6,    5,   22,   22,  -15,
          8,   -3,   25,   26,   24,   10,    7,  -79,  -55,  -73,   14,
          8,  -75,  -55,  -96,   -8,  -82,   -7, -102,  -81,  -80,  -78,
          8,   18,   17,    4,  -19,   -4,    3,   20,   20,  -20,   18,
          3,    1,   26,   20,   22,   -8,   23,    9,   18,    7,  -10,
          1,   -1,    0,    7,   21,    3,   16,   22,   11,   20,    4,
          8,   20,   28,    2,   -5,   26,    8,   16,   -2,   10,  -17,
         33,   28,   24,   28,  -11,   11,   -1,   11,    2,  -12,   28,
         25,   21,  -17,   -3,    7,    4,   16,   25,   16,  -17, -105,
       -103,  -94,   -5,  -12, -100,  -89, -105,   -4,  -86,    2, -111,
       -107,  -87, -108,   -4,    4,   15,   33,    1,   -1,   22,    7,
         15,    9,   31,    0,    5,   18,   31,   31,    6,   12,   37,
         31,   -1,   -3,   15,   22,   37,   -4,   21,    1,   34,   27,
         35,   16,    2,    0,   18,   10,  -17,  -14,   26,    1,    6,
         -6,    3,    3,   29,   28,   11,   22,    4,   17,   22,   26,
        -19,   10,   25,   10,   -5,  -19,    1,   -5,   19,    0,   24,
         -2,   -1,   34,   18,   37,   -9,    5,    7,   29,   22,   -4,
          6,   -7,   36,   29,   28,   18,  -21,   32,   32,   24,   10,
         -1,   15,   15,   42,    9,   24,    0,   23,   25,   28,   16,
        -16,   10,   20,   18,  -12,  -14,   13,   10,   -1,    0,   14,
        -12,   -5,    3,   26,   24,    2,   28,   11,   13,  -19,    7,
          9,    2,   18,    7,    0,  -18,    8,   16,   10,   22,   -2,
          8,   21,   13,  -10,   -2,   14,   16,    1,  -10,   28,  -18,
         24,   -2,   19,   19,  -10,    8,   22,   29,  -17,    2,   23,
          6,   18,  -17,   18,   21,   22,   18,   25,   31,  -17,    4,
         18,   12,  -21,    9,   25,   23,   13,    9,   11,  -16,   15,
         23,   13,    1,  -17,   17,   -1,   21,    1,    3,   19,   16,
         10,   11,    9,  -16,    8,   19,   11,   14,    6,   29,    8,
         25,   -8,    2,   14,    1,   10,  -19,   22,   -5,    3,   30,
         12,   19,   -4,   35,   19,   32,    6,  -13,   10,   21,   23,
         -3,   32,    2,   34,   16,   27,   41,    0,   17,   15,    7,
          0,  -12,   24,   16,   21,    9,   18,    7,    0,   23,   25,
          2,  -16,   29,   20,   26,   -6,  -16,    2,    9,    3,   -2,
         12,    9,    2,    9,   23,   26,   12,   16,  -13,   -6,    5,
          4,   -6,   -6,   -5,    1,   -5,    8,    0,   -8,    4,   14,
          3,  -79,  -79,  -94,    8,   11,  -89,  -88,  -82,   -5,  -97,
         32,  -92,  -81,  -87,  -74,   -1,   15,   25,    5,  -13,    6,
         12,   18,   24,    3,   25,  -13,   -2,    0,    0,   -3,   -2,
          1,   19,   17,    8,    6,   26,   -4,   13,  -12,   20,   -4,
         21,   10,    5,    9,   -7,   22,   11,   22,   10,    1,   17,
          2,   14,  -12,   25,    1,   11,   20,    9,   25,   -6,   14,
         14,   15,  -15,  -10,   15,   22,   20,   -1,    5,  -13,   -3,
         -4,    6,   21,  -11,   24,   17,   24,    6,    8,   12,   -1,
         17,  -12,   16,    2,    8,   22,   10,    2,    0,    3,    7,
          6,   -1,    1,   24,   25,    3,    7,   -2,  -19,   10,    3,
         17,   17,   -5,   28,   21,   24,  -21,  -15,   23,    1,    8,
         -9,   17,  -16,    6,   20,   24,   -2,   -9,  -80,  -82,  -75,
         -6,   -1,  -81,  -66,  -57,    7,  -53,   -1,  -59,  -65,  -65,
        -73,   -7,   18,   18,   12,    1,    2,   28,   13,   14,   -2,
         24,  -19,   17,    7,   19,    8,    0,  -11,    0,    2,    2,
        -15,    8,   -6,   -4,   -4,   -3,  -11,   14,  -12,    8,  -10,
          3,   33,    9,   18,  -18,    7,   27,    3,   19,    1,   13,
          2,    7,   31,   30,   27,   -6,    9,   15,   30,  -11,   -7,
          9,    0,    2,   -8,   23,  -18,   28,   15,    5,   30,  -12,
         23,    2,   34,   -6,   -3,   18,    5,   12,  -16,   34,    3,
         14,   24,    4,    8,   11,   -4,  -12,    1,  -14,    1,   13,
         18,   -7,   -8,   10,   13,   17,    8,    3,    0,   -9,   19,
         13,   18,    3,  -12,    3,    4,   24,  -17,   24,   -1,   21,
         11,    3,   21,    5,    2,   17,   21,   -7,  -12,   27,   23,
          1,  -15,    0,   -5,    9,    7,   20,   25,  -18,   13,   25,
          8,   -9,  -15,   23,   15,   -4,   -6,   13,    3,   22,    9,
          4,   18,   -6,   -3,   11,   22,    7,  -17,    9,   24,   21,
         -4,   11,  -10,   20,   19,   10,    2,  -15,   11,   28,   17,
        -16,   -5,    5,   22,   15,  -12,   16,    9,   24,   -1,   18,
          5,    0,   27,   10,   -4,    6,    8,   12,   21,    1,  -17,
          9,  -13,   23,   14,   10,    7,  -11,    6,   18,    7,   12,
          6,    7,   29,   18,   -8,   17,   -7,   25,   20,   22,   14,
        -21,   28,    7,    5,    4,    7,    7,   24,   15,  -14,    6,
         -2,   19,   11,   14,    8,    4,   -7,    2,    7,   -6,   -4,
         -8,   17,    1,    5,    2,   -1,   20,   13,   -6,   12,    8,
         18,   15,   -3,  -20,   -9,   22,    7,   -2,   -4,   11,    7,
         15,   15,   22,   28,    4,   11,   21,    0,   -3,   -9,    7,
         12,    1,    4,   23,   -5,   24,   29,   28,    4,   12,   11,
         10,   15,   -8,   -2,   22,   14,    4,   10,    6,    2,   33,
         23,    7,   29,    0,   38,   18,   22,    0,   -6,   16,   26,
         42,  -15,   44,    8,   45,   19,   23,   36,    0,    4,   23,
         14,   -1,    7,   17,   19,   19,   -3,   26,    6,    8,    7,
         24,    3,   -4,    4,   24,   13,    6,  -21,    3,   17,   24,
          0,   -4,   -5,   26,   21,   25,   14,  -13,   27,   35,   23,
         15,    0,   23,   12,   35,   11,   12,    0,   11,   11,    7,
         34,   23,  -14,   22,    9,   39,   45,   -5,   37,   -2,   38,
         15,   46,    6,  -13,   18,    7,    7,  -14,   23,  -14,   23,
         11,    9,   20,    0,   17,   10,   16,   -3,    6,   13,  -13,
          3,  -16,   15,   -4,    8,   13,  -15,   10,  -17,   25,   18,
         23,    1,    3,   22,  -11,    4,    7,    3,    1,   27,   -5,
          1,   10,    2,    0,    8,   16,   -6,   -7,   20,   -2,   17,
        -21,   -2,   -9,   10,   23,    4,   18,   -1,    7,   -2,    7,
          4,    5,    2,    9,   17,   -9,   20,   -9,   19,   16,   -7,
         28,   12,   24,   -2,   36,   24,  -11,   17,  -16,   28,    5,
          5,   -1,   22,   16,    6,   -1,  -13,   27,    8,   28,   20,
         -8,   26,  -15,   18,  -20,   -3,    0,   17,   12,    3,   19,
         -8,    1,  -17,   27,    1,  -17,    9,    3,    8,    5,    6,
        -18,   17,   27,  -14,   -3,  -11,   -3,  -28,   12,  -13,   -3,
          0,   -8,   26,    2,    6,    6,    0,   20,  -13,    4,   -2,
          7,   31,   18,  -19,   -5,    5,  -19,  -89,  -11,  -90,  -16,
        -80,  -91,    2,  -64,  -13,  -82,  -83,  -75, -119,  -12,  -98,
         -8,    5,  -15,    9,    2,    5,   21,   -3,   16,    2,   14,
        -12,   17,   -3,  -10,   10,  -18,   13,  -22,    9,  -17,    7,
          0,  -11,   16,  -14,   -1,   15,   29,    1,  -10,   19,  -14,
         21,    4,   25,   -1,   13,   37,   -6,    4,  -15,   33,    7,
         12,   26,  -12,   12,   -5,   -1,   -6,   16,   10,   19,   25,
          4,   27,    0,   25,   21,   21,    7,   -7,    5,  -18,  -79,
         -6,  -89,  -11,  -91,  -97,   11,  -73,   10,  -83,  -94,  -98,
       -105,   -6, -112,   12,   15,  -21,   22,    2,   21,   26,   -9,
         21,   -3,   10,    2,   26,   26,  -14,   34,    4,   18,   -4,
          9,  -10,   26,   15,  -13,   11,  -16,   22,   -7,    8,   10,
         -7,   36,   10,   25,    0,    4,  -10,   14,   24,  -16,    1,
          6,    7,  -19,   26,   -2,  -20,   20,   -1,   27,    7,   16,
        -15,    4,   14,   -1,    8,   -9,   14,    3,   16,  -21,    4,
         18,  -18,   15,  -14,   10,    6,    8,   35,  -18,   20,   -4,
         24,   -2,    9,  -15,    2,   25,   12,   29,    1,   11,    0,
         33,   40,    3,   12,    7,   16,   10,   19,   22,    7,   28,
         -2,   26,   -4,   20,  -16,   17,   -3,   -8,   -4,   -4,   16,
        -13,   15,   20,   -1,    4,    3,    3,    5,   25,    2,   18,
         16,   -8,   11,  -18,   24,  -13,   14,    0,  -18,    5,   -5,
          8,   -8,   14,  -14,    6,   23,    7,   18,    4,   28,   14,
          2,   10,  -14,    4,  -18,   12,  -12,   34,    8,   13,   17,
          8,    3,   -1,   30,    6,    0,   54,   23,   29,  -14,   -4,
          6,   10,    5,   10,    9,   11,    7,   -7,   27,  -24,   27,
          4,   -2,   18,  -17,    7,    2,   15,    7,   -5,   -4,  -18,
         18,   -2,   21,    0,   21,   -6,  -11,   22,  -12,   28,   -5,
         32,    4,   11,    3,   -8,   25,  -14,    8,  -12,   15,   12,
          8,    7,   -4,   14,    4,   15,   -5,   26,   37,    6,   42,
        -19,   38,    9,   19,   -6,  -11,   25,    8,   15,   -5,   22,
         -9,   20,    8,   -7,   24,   11,    5,   16,    0,   12,  -18,
         14,    7,   10,    5,   30,   -1,   15,   26,   -7,   23,    5,
         25,    5,   17,  -17,   -8,   13,    1,    6,  -12,    6,    1,
         -1,   -4,  -11,  -13,   -2,   -4,   14,   -9,   -8,    8,    7,
         13,  -69,   18,  -91,   -4,  -77,  -94,    9,  -91,  -10,  -91,
        -90,  -80,  -82,   39,  -68,   21,   22,    3,   17,   -3,    7,
         13,  -15,    0,  -19,   15,   19,   19,   16,    4,    3,  -13,
         14,    3,    1,   -4,   13,   16,   -5,   26,    4,   27,  -11,
         -1,   21,  -15,   10,  -22,   -6,   -1,   20,  -13,   24,   12,
         12,   -4,    2,   19,  -22,   19,   -2,   -7,   16,    2,    2,
        -13,   22,  -14,   13,   22,  -11,    8,  -17,   17,    6,   26,
         -9,   -4,   12,    6,   21,    7,   13,   -9,   17,   26,   -3,
         26,    1,   20,  -20,   23,  -27,   -9,    7,    0,   11,  -16,
         19,    9,   24,   22,    0,   22,   -6,   18,    8,   18,  -21,
        -16,    5,  -10,    9,   -9,   28,  -16,    2,   23,  -17,    9,
          3,   -3,   12,   15,   20,    2,   24,   -1,  -74,    1,  -81,
         12,  -65,  -61,  -13,  -78,    8,  -79,  -53,  -78,  -68,  -18,
        -83,  -15,   14,   -1,   19,   -4,   30,   13,    6,   13,    2,
         15,   -1,    3,   16,   -9,    7,   -7,   -3,    1,   11,  -13,
        -11,   15,   -8,    5,    2,    2,    3,   -5,    4,  -11,   -6,
          5,   18,    7,   16,   -5,   10,   23,  -14,    9,   -4,   30,
          8,   12,   20,   -3,   12,    7,   11,    0,    6,  -17,   28,
         23,   10,   31,  -18,   31,   -7,   13,  -10,  -10,   29,    7,
         35,   -5,   29,    8,   17,   21,   -5,   24,    5,   22,    4,
         23,    9,    7,   34,    8,   14,   11,   10,   -7,   12,   -9,
         13,   -5,   -3,  -11,    1,  -10,   16,   -4,   14,   15,   21,
        -21,   13,  -16,    4,    7,   -2,   18,    0,   27,   -7,   11,
        -15,   -9,    3,   11,   19,   -2,    0,   -8,    2,    5,   -4,
          7,  -17,   24,   -5,   19,  -13,    2,   26,   10,    0,    2,
         11,   -4,   26,   13,    9,   11,   -8,    6,   12,   26,    7,
          7,   22,    7,   26,  -11,   22,    3,    3,   26,  -12,   14,
          9,   -4,   16,    3,  -15,  -11,   23,   -1,    8,    1,    6,
         -3,   23,    0,  -18,    7,   -4,    0,  -19,   27,   29,    3,
         18,  -17,   20,  -15,   27,  -12,   26,   21,   -2,   -2,  -16,
         18,    3,    7,  -11,    8,   26,    7,    4,    1,    6,    6,
          1,   19,   -9,    0,    8,   23,  -29,   25,   22,  -11,   18,
        -17,    6,    5,   20,   -9,   26,   12,    6,   16,  -15,   10,
         11,   20,   11,  -16,   11,  -17,   10,  -15,   18,   12,   -2,
         16,   -4,   -6,    4,   -7,  -13,    0,   -6,    0,    0,   13,
         -1,  -13,   10,   11,   26,   15,    4,    8,    6,    0,  -21,
         12,   -1,  -13,   11,  -12,   28,    6,    8,    6,   17,   27,
          3,   11,  -10,   23,  -18,    6,  -12,   -1,   22,   11,   22,
         -1,   13,  -17,   15,    3,   -7,   27,   10,   21,  -11,   29,
         12,    6,   17,  -12,   40,    3,   21,    7,   40,   45,    1,
         35,    6,   35,   -8,   21,  -11,    6,   35,  -14,   20,   -3,
         14,    9,   29,   11,   -4,    3,  -14,   30,    5,   23,   -8,
        -13,   25,  -10,    0,  -17,   -2,    4,   17,    7,    8,   14,
         -2,   28,    2,    4,   -4,  -18,   13,  -17,   17,   -3,   15,
          3,    6,    7,   -7,   35,    2,   37,   10,   17,   43,   -8,
         12,   -3], dtype=int8)
%network.8.weight, shape: [1, 1, 32, 1], exponents: [-7], docString: layout ==> N16HWC16_UNALIGNED, 
value: array([ -3,  46,  42,  32, -12,  -3,  39,  48,  49,  -9,  39, -24,  38,
        31,  28,  37,  38,  -4,  33, -14,  41,  32,  -8,  50, -15,  27,
        62,  44, 120, -44,  32,  -2], dtype=int8)
%network.8.bias, shape: [1], exponents: [-11], docString: layout ==> UNK, 
value: array([1791])
%network.0.weight, shape: [1, 1, 13, 128], exponents: [-6], docString: layout ==> N16HWC16, 
value: array([  0, -15, -12, -18,  16,  -7,   6, -26,   0,  -1,  -6, -44,  -7,
       -20, -19,  26,   9,   2,   4,  -8,  -5,  -6,  -3,   4,   6,   0,
       -21,   5, -14,   3,  30, -27,   9,  10, -17,   7, -53,  -8,   6,
        -8,  10,   2,  -8, -43, -12,  -3,   1,  -8,  11,   4,   6,   7,
        -2, -20,   3, -16, -10,  -4,   2,   2,  -3,  10,  -1,  11,  -6,
         6,  -6, -11,  -5,  -3,  -7,  12,   0,   1, -22,   7, -16, -19,
       -16,  27,  14,  -6, -11,   2,  20,  13,  24,  13,  21,  -3,   9,
        17,   1,  19,   0,   8, -10,  -8,  -7,   7,  -3,  -9,   4,   2,
       -13,  -4,   4, -10,  -5,  11, -15, -14, -10,   7,   0, -16,   4,
        -9, -19, -23, -27,   3,  -5, -15, -17,  -3, -13,  13,   1,  17,
        17,   3,  -3,   4,  14,  -2, -11,  12,  11,  12,  -7,  -6, -16,
         5,  -6, -16,  -5, -17, -36,   2,  -9,  -7,  13, -13,  -1, -17,
       -17,   7, -12,  -5,   1, -22,  14,   2,   9,   6, -11,  -8, -17,
         7,  -2,   7,  -8,  -6,  -5,  -7,  12,  16,  -5, -16,   6,   9,
        14,   3,  -3, -14,  -3,  -8,   4,  -7,  13, -19,  -6, -10, -14,
         1,  -4, -20, -41, -22, -29, -20, -20,   8, -17, -18,  -4,  15,
        -6,   1,  -6,  18, -48,  -9, -31, -50,  16,  28,   7, -23,  16,
         6, -17,  -7,  -3,  -7,  -5, -16,  -5, -17, -20, -16,   7, -12,
         1, -14,   3,   2,   3,   0,  17,  -2,   4,  10,  -1,   6,   6,
         4, -10,  16,  -3,  13,  11,   1,  11,  -6,  -4,  -3,  -4,   0,
       -21,  10,  13, -21,   9,   7,   1,   8,   8,   8,  -1,   0, -14,
       -11, -27,  14,  -4,  -7,  12,   3, -22,  18,  -7, -15, -17,   6,
         2, -19,   6,  29,  22,  31,  26,  -1, -10,  34,  21, -21,   9,
        19,  22,  22,  12,  20,   0,  -4,  13, -14, -12,  -9,  -5, -17,
        17,  11,   4, -18, -14,   0,  -2,   1, -26, -21,   8, -43,  -5,
       -14,   4, -21,  -7,  -8,   3,  -1,  -3,  12,   1, -26,   8,   3,
         8,   8,   1, -15, -10,  -2,   1, -15,  15,   9,  -1,  -1,   5,
         6,   2, -13,  -7, -14,   0,  17,  -9,  -7,   3,   3,  -2,  -3,
        -8,  -5,  -4,   1, -23, -10, -12,  13, -13, -14,  -8,  -4,   9,
        -9,  -2,   3,   6,  -8,  -3,  -2,   8,  12,  -9,  -5,  -3,   5,
        12,  -1,  -7, -18,   8,  15,  -7,   0,  -2,   3, -53,  18, -15,
        11,  -2,   9,   2,  16, -26,  18, -36,  -3,  -6,  -2, -24, -18,
       -24, -28, -19,   0, -20,  -9, -11, -37,  -4,  -2, -14, -14,  48,
         0, -25, -19,  12,   2,  -3, -28,  11,   7,   8,  -5,  -9,   1,
         9, -12,   5,  -4,   6,   3,   3,   0, -10,   7,   5,   4,  -2,
        -3,  -9,  13,  -9, -18,  16,  -6,   2, -12,  -1,  11,  -7,   5,
         6,   6,  -2,  -2,   7,  -2,  -9, -13,  -1,   4,  -4,  -8,  -4,
        -4, -21, -27,  -5,  -1,  -5,   1,  -1, -16,   7,   2,  -6,  -9,
        11,   8,  16,  -8,   9,   1,   3,   5,  17,  20,  13,  33,  22,
       -13,  -8, -23,   6,  10,   9,   9,  15,  13,   8,  -3, -15,  -8,
       -17,  -4,  -3, -15,  -7,  17,   0,  -8, -16,  -1,   0, -18, -22,
       -12, -19, -18, -22, -10,  -9,   1,   6, -56,  -1, -21,  -3, -18,
         9,  24,  -8,  -2, -15,   7,  -1,  -6,  10,  14,  15,  27,  -6,
        -6,   1,  -2,   1, -22,   3,   3,   2, -15,  19,  -1, -18,  13,
       -11, -13,  -8,  -2,  10,   9, -10, -16,  -2,  -3,   3, -15,   2,
       -15,  -7, -10, -19,  -3,   0, -10,  -7,  -7,   3,   2,   3,  10,
        -1,  -4,   9, -10,  -4,  16,  20,   6,   7,  13, -32,  -5, -34,
         2,  -7, -15,  -7,  10, -31, -35,   1,  12,  15, -43, -22,  -8,
       -17,  -8, -21, -22, -33,  -2, -17,   3,   4,   3,   9, -28, -35,
         0,  -2,  -4,   0, -12,   6,  -4, -12,  13,   3,   8,  -5,  -3,
        -1, -12,   6, -16,  -4,  -6,  22,  -8,   4,   9, -12, -13,  11,
        16,  -7,  16,   8,  -3,  10,  -4, -23,   8,  14,  10,  10,  -1,
         6,  -7,  -2,   0,   1,   4,   2,  -3,  -4, -14,   8,   2, -23,
         0,  -1,   5,   7, -10,   4, -10,   5,  -9, -25,  -4,  -7, -12,
       -14,  12, -36,   3, -10,  30,  -7,  -7,  33,  31,  22,  -1,  -6,
        -4,  24,   3,   2,  -8,  -1,  -6,  18, -17, -12,   9,  -5,  -7,
        -9,  -5,  15,  -6,  -2,  -1, -14, -10, -91,   4,  -7,  -7,   0,
        -4,   7, -19,  -1,   4, -57,   4,  -7,  -1, -10,   8,  19,   9,
       -12,  -7,  23,   4, -18, -13,   2, -12,   4,   3,   5,   2,   1,
       -15,   0,   1,  10, -14, -13,   7,   1,  -3, -17,  -9,   9,   2,
         6,  -3,   7, -12,  21, -15,  -5,  -6,  -6,  -9,  -5, -11, -17,
         0,  -8, -15,  10,   4,   5,  -8,   3,  13,  12,   1,  15,   0,
       -11, -18,  13, -17,  -1,   9,  -1,  -8,   4,  -1, -33, -19,  10,
        10, -19, -13, -42, -22,   6,  -3, -23, -10, -32,  -4,  11,  -1,
       -14,  27, -17,  -6, -28, -25,  -2,   2,  10, -24,  -5, -10,   1,
       -11,   5,   1,  -3,  19,  -4, -16, -28,  -1, -15,   0,  -2, -10,
        -8,  -6, -22,   2,   3,  15,  -6, -19, -10, -12,  -9,   4,  -6,
        -5,  -5,   2,   7,   4,  -1, -22, -15,  -5, -10,   3,  -2, -15,
         2,   9, -17, -11, -12,  11,   7,   9,  18,  11,   5,   7,  -8,
        21,  12,  16,   1, -24, -13, -13,   3, -16, -22, -24, -18,  -9,
       -12,   5,  11, -17, -12,  -9,   0,   5,  15,  24,   2,  -6,  29,
       -15,  -8,  -3,  -6,  13,  10,  -2,   2, -15,   2,   8, -16,  15,
       -11,  -8,   2, -10,   7, -11,  14,  -7,   5, -24,  12,  18,   4,
         4,   2,   7,   1, -17,  20,   0, -18, -24, -13, -23,   5,   9,
         4,   7,  -7,  15,   6,  16,  20,   2,   8,  10,  -9,   9,  -4,
        -3,   3,  11, -14, -16,   7, -12,  -7, -11,  11,   2, -25,  -4,
        -4,   6,  -8,  10, -17, -15, -13, -17,  12,  -2,  -9,  -4,   8,
         4,   3,   9,   6,  14,  -7,   2,   7,  -2,   6,  -5, -18,   6,
       -13,  -6, -48,  15, -11,  15,  -5,   8,   3,  -2, -22,  30,   8,
       -14, -21,  -7,   8, -22,  -9, -34, -32,   0,  -4, -18, -16, -48,
         3,   6, -14,  -6,  14,  14, -15,   0,   8,  -8, -25, -32, -18,
        13, -11, -13, -17, -17,   0,  -8,   1,  -4,   3,   0, -16,  16,
         4,  -6,   1, -20,   1,  -3,   5,  12,  -5,  -3,   4, -19,   9,
         5,  12,  -2,   0, -10,  -1,  -2,   7,  16,   4,   0,  12,  -4,
        -6,   0,  -5,   3,  -8, -16, -19,  -4,  10,   0,  -3,   8, -25,
       -13,  -4, -16, -17,   1,  -9, -11, -16,  16,   3,   8,   5, -10,
         4, -10,  25,  -9,   3,  29, -11,  -6,   6,  24,  -6, -10,  12,
        24,   6,  23,  25,   0,  -8,   1,   3,   0,  15,   4,   7, -18,
         4,  -8,  12, -11,  -4,   7, -14,  -9,  -3, -40,   4, -10,   6,
        -4,  -1,  -8,  12, -13,  -5,  -1, -10,  -4,  -5,  -9,   4,  16,
        -9,   2,  -8,  -6,  -6,  -5,   1,  -9,  -5, -13,  -5,   7,  -1,
         7,   4,  -2,  11,  13,  11,  24,  16,   8, -15, -17,   9,   7,
         7, -28, -16,  14, -18, -18, -16, -11,  -5, -13, -15,  11,  -4,
        12,  -2,  -9,  -6, -16,  -6,  -8,   8,  -2,  -4,  13,  10,  12,
       -17,  17,  -1,  -5,  -5,  13,   9, -11,   0,   6,  -5, -30,  -4,
       -28,   3,  16,   6, -13,   2, -17, -30,  12, -19,  -1,   5, -33,
        24,   1, -26,  11, -10, -21, -25, -16, -14,  -3, -26,  -5, -15,
        -9, -21, -24,  12,   1,   4,   6,  -1,   5,  11,   0,  -4,  -7,
         2,   4,   6, -10,   6,  -7,   8, -12,   3, -13,   9,  -8,   2,
        -2,  -1, -14,  -9, -15,   4, -10,   3,  16,   2,  -3,  -2,   9,
         2,   8, -15,  -6,  -6, -12,   5,  11,  17,  -4,  -4, -16,   3,
         5,  -2, -23,   6,   4,  -1,   0,  -6,  15,   3,  -7,  -7,   5,
         0, -10, -24,  -2,  13,   1, -15,  20,  12,   9,  16,  -5,  23,
        26, -40,  -7,   9, -17,  19,  -5,   1,   4, -12,  -6,  12, -11,
         6, -18,  11,   6,  11,   9,  -5,  22,  15,  14, -12,  -7, -15,
       -20, -31, -11, -12,   8,   0,  -9,  -3,  -4, -20, -36,  -9,   1,
         8,  11, -25,   3,  -9,  13,   9,   4,  -1,   4,  14,  10,   7,
        12,  -5,  -4,  -5,   7,  -3, -10,  -5, -14, -17,   3,   5,  -4,
         5,   1,  -5,  -5,  16, -13,  -9,   8,   7,  -3,  -6,  -4, -11,
       -12,  -6,  -7,   3, -13,   0,  13,  -3, -15,   3, -10,  13,   5,
        14,  15,  -3, -17,  -6,  11,  -6,   4,   8,  -1,  19,  12, -12,
       -31, -12,  -7, -17,  -4, -17,   4, -23,  -2,  -4, -39, -28, -30,
       -20, -18, -23,  43, -26,   6, -26,   2, -14, -11,  -1,  20,   4,
       -35,   7, -10,  11,  -3, -13,  -9, -18,   5,   3,  -6,  10,  18,
        -9,  15, -11,   3, -28,   6,   6,   7,   1,  -7,  13, -12,   8,
       -17,  -1, -10,   5,   0,   1,  11,  -1,   9,  -1, -11,  -1, -11,
        -7,  -3,  -6,   7,  10,   1,  -3,   6,   4,   1,   1,   7,   1,
         3,   1,   2,  -2, -17, -22,  -1, -13,   0,   3,  -1,   9,  -3,
        -1,   4,  15,  29,  18, -24,  13,  -1,  20,  -9, -16, -16,  34,
         7, -12, -13, -10,  16,  -8,  -8, -14, -13, -12,   7,  10,   3,
         4,  -4,  -8,  -5,   0,  -6,  -4, -19, -23,   1, -39,   7,   1,
        17, -11,  12,   5, -12,   1, -29,  -8,  -5, -47,  -8,   7,  -6,
         3, -11,  13,  -6,  -8,  -1,   1,   2,   7,   3,  17,   8,  18,
         9,   9,  16, -14,   3, -12,  12,  -4, -17, -17, -11, -25,   5,
         0, -11,   3,  -1,  -4, -18, -12, -16, -12, -12,  -5,  17, -13,
        -6, -18,  -2, -15, -18, -17,   1,  -6,   1,  14,  13,   5,  -7,
         3,  -5,   2, -11,  -6,  18,  -6,  19,  11,  11, -35, -48,   7,
        -6,  -4,  13,  -5,   7, -13, -17,   8, -43, -13,   1, -42,  -9],
      dtype=int8)
%network.3.weight, shape: [1, 1, 128, 64], exponents: [-7], docString: layout ==> N16HWC16, 
value: array([   6,    2,   -5,   -1,    5,    8,   -1,    0,    0,   11,  -19,
          9,    0,    8,    2,  -23,   -8,   -6,   -1,    0,   -3,   -1,
          4,   -3,    4,    9,  -43,    7,   -2,    1,   -4,  -15,   -5,
          9,   15,    0,   13,    0,    3,   -4,    3,   18,  -45,   -1,
         10,   16,   -6,    6,   -1,   -8,   10,   -5,   -4,    4,    6,
         -1,    2,   -9,  -10,    8,    7,   -8,   -3,   11,   60,   75,
         66,   63,   59,   63,   59,   58,   53,   74,  -14,   63,   66,
         50,   58,   15,   -7,   16,    9,    2,   18,    9,    6,   -2,
         10,    5,  -22,   -1,   10,   -1,    8,  -54,   14,   13,    1,
         17,   17,    6,   15,   12,    7,    1,   34,    6,   17,   -3,
          6,  -32,    7,   -4,    2,    9,    0,   -1,    9,   -6,    8,
          8,  -19,   11,    2,    3,   -6,  -70,   35,   29,   21,   34,
         25,   13,   11,   10,   23,   22,  -14,   27,   17,    4,   17,
        -29,   -1,    3,    9,    9,    9,    2,   -2,   10,   -2,  -11,
        -29,    0,    7,   -1,   -1,   -7,    7,   -9,   -1,   -1,   -3,
        -14,    7,    3,   15,    1,  -39,    5,   14,    8,   -2,  -27,
         26,   40,   25,   28,   31,   29,   33,   27,   30,   23,   16,
         19,   21,   29,   13,   38,    8,    7,   -8,   11,  -10,    1,
        -11,   -1,    8,    8,   -5,   -2,    8,   -4,  -11,   -2,   -5,
         11,  -10,   -1,    6,   -5,    1,   -7,    9,   -2,  -55,   12,
          1,    1,    4,  -20,   22,   19,    6,   24,   -4,   26,    2,
         18,    9,   29,  -11,    7,    8,   -6,    6,    4,  -65,   -9,
        -27,  -26,  -17,   -8,  -21,  -16,   -4,  -12,   25,  -11,  -19,
          1,   -8,   -7,   48,   46,   42,   26,   42,   38,   35,   36,
         39,   40,    2,   20,   45,   45,   42,    3,    5,   22,   12,
          5,    6,   23,    3,   15,   13,   13,  -11,   17,   26,   25,
         17,   16,    7,    9,   -2,    0,    5,   20,    2,   16,    9,
         14,  -29,   -3,    6,  -19,   -1,   -6,  -97,  -43,  -58,  -40,
        -30,  -94,  -44,  -41,  -40,  -40,  -37,  -44,  -49,  -50,  -57,
        -68,    8,    1,   15,   13,   10,    8,   -3,   18,    8,    7,
        -11,    0,   -2,   -1,   18,  -13,    2,    6,    5,    0,   -3,
         -3,   -3,   -6,    9,   -8,    6,  -10,    7,    1,    6,   -7,
        -11,   -3,   -1,   -3,    9,   -5,    4,    2,    5,   12,  -18,
          5,   -1,   -9,    7,   -4,   19,   27,   26,   24,   30,   25,
         27,   24,   17,   18,   33,   12,   29,   15,   18,   38,   -3,
          1,    3,    6,    8,    3,   -5,   17,   21,    9,  -55,    6,
         12,    9,    0,    5,  -94,   -2,  -21,    4,    0,   -9,  -11,
         -7,   -8,   -9,  -17,  -10,   -2,   -2,   -6,  -12,    7,    5,
         18,   11,   15,   16,   11,    2,   17,    5,    0,   -4,   13,
         -2,   14,  -35,    0,   -7,    4,   11,    7,    5,   16,    8,
         12,    2,  -42,    1,   -4,    2,   10,  -47,    9,    2,    2,
          0,   -5,  -10,   -1,   -1,   -4,    8,  -18,   -1,    0,   -4,
         -3,   12,  -11,    4,    9,   11,   10,    1,    9,    2,   -4,
         10,  -35,    7,   12,    3,    2,   -4,    5,    6,   -1,   12,
         -6,  -10,   -2,    2,   -3,   11,  -25,   -2,   -7,   -3,   12,
        -28,   11,    2,    2,    2,   11,    0,   -7,   -1,   10,   -3,
        -20,    6,   -5,    1,    4,  -39,   -6,   -4,    1,   -3,    0,
          2,   -4,    6,    0,   -1,  -66,   -3,    9,  -16,   11,  -43,
         -3,   -4,   -8,    1,    7,    1,   -7,    0,    1,    4,  -18,
         10,  -10,  -12,   -2,    1,   14,   -2,   17,    8,   20,    6,
          9,   15,   15,    8,  -32,   11,   -7,   11,   17,   -2,   26,
         38,   36,   33,   29,   36,   30,   28,   23,   21,    4,   25,
         33,   30,   38,  -27,   -2,    7,    1,    5,    1,   -1,    6,
          9,   10,    2,   13,    2,    6,    8,   15,    2,    1,    8,
         -8,    3,    8,    3,   -6,    4,    5,    1,    2,   14,    0,
          4,    3,   -2,    2,   10,    2,   -3,    4,    6,    6,    5,
          2,    8,  -43,   -1,   -7,   -1,   14,  -50,   19,   25,   12,
         27,   18,   25,   10,   18,   21,   16,   17,   19,   23,   16,
         14,   15,    1,   -5,   -2,    2,    8,    6,   11,   14,   14,
         11,  -31,    2,    6,  -24,   -7,  -46,   33,   33,   18,   30,
         27,   21,   21,   34,   41,   36,   -5,   21,   22,   -2,   37,
        -11,    6,    9,   -7,   17,   11,    6,   11,   16,    6,   10,
          0,   15,    4,    6,   -1,   22,  -11,  -10,    2,    1,   -3,
         -1,  -13,   -2,   -3,    7,    3,    7,    6,    7,    4,   -2,
        -42,   -5,  -27,   -2,  -16,  -37,  -19,   -1,   -4,    4,   -4,
        -18,  -20,  -14,    0,   -4,   61,   76,   60,   50,   75,   69,
         70,   61,   67,   63,  -10,   62,   73,   60,   77,   27,   -5,
         -5,    6,   -4,    7,   -2,   -2,    7,   11,    5,  -24,    6,
          3,   -4,   -6,  -14,    7,    5,    0,   15,   -5,  -12,    1,
          0,   -5,   10,  -45,    0,   -8,  -11,   -2,  -40,   75,   60,
         75,   60,   70,   70,   72,   82,   69,   70,    5,   72,   68,
         76,   81,   56,   17,   10,   11,    4,    1,    2,    1,    6,
         -4,   12,   -9,   13,    9,    4,    1,  -14,  -11,    6,  -11,
          9,    9,   -4,   -7,   10,    6,   -5,   12,   -3,    0,    3,
          1,   -2,   14,   12,   19,   10,   25,   22,   25,   10,    5,
          6,   15,   12,    3,    4,   12,   32,   -5,   -1,   -4,   13,
         10,   -5,    0,   15,   -3,   -4,  -26,   11,   -8,    0,    5,
        -39,    9,   -4,   -2,    3,    5,    3,  -10,    5,    7,  -11,
          7,    3,    4,    0,    8,    1,   24,   25,   40,   27,   41,
         38,   18,   24,   30,   36,   -5,   22,   37,   61,   29,    1,
         13,   25,   33,   23,   22,   38,   12,   13,   26,   35,  -48,
         27,   42,    9,   20,   -3,   -5,   -2,    8,    4,    5,   -7,
          5,    3,    4,    4,  -15,   -3,   -7,  -10,    0,  -20,   -5,
          3,   -1,  -11,    6,   -1,   -7,    6,   -8,    7,   11,   -1,
         -6,  -11,   -8,   -1,   45,   39,   51,   32,   47,   56,   32,
         38,   30,   40,  -71,   47,   40,   50,   28,   13,  -14,    6,
          5,   -5,   11,    8,    0,    4,    1,   -3,  -41,    9,    5,
          0,    7,  -27,   12,    2,   19,    4,    8,  -12,    0,    1,
         -4,   11,  -18,   10,   -2,    3,    9,  -42,   -7,   -5,    6,
          9,   11,   -4,    1,    7,    1,   10,   14,   12,   -6,   -4,
          2,   16,    0,    3,   -1,    8,   10,   12,    5,   -5,    1,
         11,  -16,   -7,   -2,   15,    4,    7,   -3,  -11,    6,   -3,
         -8,   -6,  -10,   10,    7,    7,    7,   -3,   -8,    1,  -11,
         -6,   -1,    8,    9,    7,   13,    3,   19,    5,    5,    1,
        -14,    1,   13,    5,    1,   -1,  -62,  -23,  -44,   -4,   -6,
        -21,  -36,   -6,   -9,  -12,  -15,  -14,  -14,  -16,    3,  -17,
         -4,    1,    5,    9,   11,    4,   -5,   -3,    2,   10,   -4,
          6,    4,    6,   -4,   -2,   -7,    2,   -6,   -9,   -6,    5,
         -7,    8,    8,    8,   -3,   -6,   -1,    8,   -4,   -5,  -19,
          0,    5,    2,   -8,   -9,    6,   -6,   -5,   -8,  -16,    2,
        -15,   -5,    3,  -10,   -3,   -2,   -1,    4,   -6,    1,   10,
          4,    7,    3,   12,    2,    6,   -3,   -5,   20,    6,   -3,
          5,   -2,   -8,   -4,   -1,    5,  -11,    2,    7,   -2,    0,
         -6,    3,   10,   -6,    4,   14,   14,    1,    8,   -1,    4,
          6,    9,  -55,    8,   13,    1,   17,  -19, -124,   -9,  -27,
        -14,  -10,  -51,  -32,  -15,  -20,  -16,  -30,  -11,  -17,  -21,
        -23,  -18,    8,   -7,    9,   10,   -6,   -1,   11,   -6,   13,
          4,  -31,   11,    2,   14,   -8,  -57,   47,   35,   45,   45,
         38,   35,   45,   33,   31,   41,    4,   28,   26,   26,   45,
          6,   -5,    3,    9,    7,    6,    1,    3,    8,   -2,   -3,
        -38,   18,  -14,   -3,   10,  -42,   -3,    9,   -3,    6,   11,
         10,    8,    5,   -5,    9,    9,   10,    8,    0,    4,   30,
          6,    5,   14,    4,    4,   -6,   17,   15,    5,    9,  -51,
          9,    2,    7,    8, -100,  -14,  -10,    6,    8,   -3,   -9,
          3,   10,    2,    7,  -30,    1,   -2,   -7,    3,   10,   26,
         12,    4,   21,   19,   13,   18,    5,    9,   18,    2,   21,
          5,    2,   23,    1,   -8,    5,    3,    3,    7,    3,   -8,
          7,    8,   16,  -26,    7,   13,  -10,    2,  -60,   23,   38,
         25,    7,   16,   30,   32,   20,   36,   29,  -54,   33,   19,
          0,   30,   47,    0,  -11,    8,   -3,    0,   -2,  -10,   -6,
         -6,    1,    0,   10,   -5,    4,   13,   -4,    3,   -4,   -1,
         13,   -4,  -11,   16,   12,    9,    2,   16,    2,    8,   -8,
          2,  -33,  -12,    4,   -9,    9,   -9,  -11,    1,    0,  -10,
          3,   11,  -11,    4,   -1,   -2,    8,  -93,  -24,  -37,   -9,
        -12,  -42,  -53,  -18,  -25,  -13,  -22,  -29,  -25,  -36,  -33,
         -7,   -9,   -5,    5,   -2,    3,    8,    5,   11,   -2,   -3,
        -10,  -10,    6,    4,   -6,    3,    0,   -6,    1,   -5,    1,
          1,   -4,    5,    2,    6,  -34,    8,   -7,   -6,   -2,  -73,
         -9,   -8,    8,   -9,    4,    6,    5,   -3,   -8,    1,    4,
          8,    2,    4,    1,   -5,   -5,    6,   -7,    0,    9,    8,
         11,    1,    4,   -6,    2,    6,  -10,    4,    9,    1,    2,
         -9,    6,   12,    2,   10,    6,    8,    4,   -3,  -20,   13,
          6,   27,    6,  -67,   -2,    5,   12,   13,    2,   -6,    0,
         15,   -3,   13,  -39,    5,   -1,    8,    3,  -37,   -1,   -9,
         10,    1,   -6,  -11,    4,    2,   11,    5,  -30,    4,   -4,
         -4,   11,  -42,    8,   38,   25,   22,   23,   26,   12,   12,
         39,   15,   14,   21,   22,   17,   12,   48,   -2,    3,   -2,
          8,   18,   13,   11,    7,    1,   11,    3,   18,    7,   11,
         12,   17,   16,    4,   -1,   -1,   10,    1,    5,   13,   18,
         16,  -55,   21,   -2,   20,   21,  -18,  -46,  -16,  -15,  -13,
        -23,   11,  -17,  -29,   -9,  -15,  -28,  -29,  -13,    5,  -16,
        -28,    2,   10,   -5,    2,   -7,    7,   -3,   -2,    1,    9,
          4,  -10,  -10,   -7,   -1,    7,   -8,    7,    6,   -2,   11,
         -3,   10,   -6,    0,    7,    6,   -5,    2,   11,   -4,  -13,
          6,    2,    7,   -3,    7,   10,    5,   13,    1,    4,  -54,
         21,   -1,   16,   15,    0,  -14,   -7,   -3,    1,    4,  -10,
          1,    6,    2,    2,  -20,    1,   -2,    1,  -11,  -11,   -4,
         -4,    8,   12,   14,   -8,   -4,    6,   16,   11,  -38,   -1,
         -6,   -6,    9,  -11,  -11,   11,   -2,   -1,   16,   15,    3,
         12,   20,   -9,  -19,    0,    0,  -11,   -4,  -27,   11,   16,
         14,    3,   -3,    1,    3,   13,    4,   15,  -40,    4,   -4,
         22,  -10,  -58,    3,    4,   19,   10,   18,   -7,   12,   13,
         -3,    3,  -15,    5,    7,    0,   17,    3,   -1,    3,    2,
         -1,  -10,    7,    7,   10,  -10,  -11,   -2,   -8,  -11,   -8,
          7,    1,   -1,   -4,   10,    6,   13,  -13,   13,   -8,   -8,
          5,  -14,   -2,   -5,   -3,    2,  -31,    2,   10,   -1,    3,
         10,    2,   -3,    3,    8,   -2,   -7,    9,   -3,   10,    3,
         23,   14,   30,   23,   10,   10,    6,    6,   13,   18,   13,
        -58,   18,   12,   37,   19,  -47,   -6,    9,   16,   -1,   21,
         16,   14,    7,   11,    1,  -40,    0,   20,   10,    8,  -71,
          3,    3,    6,   -5,   16,    4,    6,   13,   12,   -4,   13,
          3,   -3,    3,   -1,  -19,   31,   53,   44,   45,   43,   35,
         48,   46,   39,   42,  -24,   33,   41,   46,   34,   38,   -1,
         -4,   -5,    8,    3,   11,   15,   16,   11,   18,  -29,    2,
         15,   -9,    7,   26,   24,   36,   32,   43,   40,   41,   29,
         25,   21,   18,    2,   31,   42,    0,   36,  -10,   18,   30,
         18,   18,   17,   26,   25,   23,   38,   34,   -3,   30,   19,
         27,   14,  -22,  -54,  -36,  -34,  -22,  -35,  -33,  -34,  -27,
        -39,  -22,   39,  -36,  -38,  -32,  -36,   41,   16,  -10,    3,
          2,   -8,   15,    4,    6,    1,    9,  -20,   -4,    7,   -4,
         15,  -17,   -3,   -2,   -4,    8,  -10,   -6,    3,   -4,   10,
         -7,    6,   -7,    0,   -1,    2,    8,   -6,   10,    5,   15,
          6,    2,    2,    7,    7,    8,   12,    0,    4,   -8,   10,
         21,   -2,   11,    5,    3,   -1,    8,   -3,   -4,   -5,   -5,
        -11,   -9,   -5,    8,   -2,    3,    7,    8,  -10,  -10,    5,
          6,    8,   -7,    1,   -5,    5,   -7,    3,    1,    8,   -9,
          9,    3,    8,    0,   -1,    5,   10,    5,   -9,    9,    9,
         -2,    6,    2,   -2,  -10,    8,    8,    4,   25,   11,    9,
          6,    6,   21,    4,    1,    2,   19,   21,   23,   24,    4,
         15,   16,   15,    5,    1,   17,   20,    9,   27,   -6,   11,
         21,    3,    5,    6,   -5,    3,   -3,   10,    2,    5,    8,
         -1,    0,    7,   -5,    9,    1,    0,   10,    8,  -21,   -9,
          6,    4,   10,   -5,   10,    0,    3,   -3,  -28,   13,   -6,
         -3,   -1,  -36,   31,   52,   52,   28,   40,   54,   51,   55,
         37,   44,  -35,   47,   50,   26,   54,  -67,    5,    2,    7,
         -1,    1,    7,   -1,   11,    4,   11,    8,   -4,    8,   12,
          4,    8,    1,    4,    0,    3,    5,   -7,    8,    6,    1,
        -14,  -11,   -5,    5,   -6,    2,    6,   -1,   -2,   10,    5,
          0,   -8,    4,   14,   10,    1,    8,    8,  -11,   -7,  -10,
         -3,   14,   13,    9,    5,    3,    3,   -1,   -4,    8,    2,
         14,    0,    4,   -8,    3,    5,    2,    1,   -7,  -10,    4,
          2,   11,    9,   11,   -4,    4,   -7,   -7,   -4,    6,    1,
         83,   58,   59,   55,   61,   53,   59,   53,   57,   16,   49,
         45,   72,   54,   64,   63,   -9,    3,    8,   15,    8,   -2,
          5,   -3,    6,   26,    9,    1,    0,   -3,   -2,   -5,    1,
          2,   20,   16,   21,   -4,    8,    6,    3,    5,   -1,    9,
          1,    1,    9,   15,   10,    0,    5,    9,   -8,   -3,   15,
         15,    9,   14,    1,   13,   10,  -10,    2,   -2,   20,   18,
         27,   24,   25,   24,   14,   29,   15,   14,   24,   29,   21,
         16,   22,   22,    4,   -5,    2,   -2,   -9,  -12,    5,    9,
          3,    8,    5,   -6,    2,    1,    7,    0,   -3,    1,    4,
         20,   -5,  -13,   -4,   -2,   11,   -2,   -1,    8,    7,   -1,
         15,   -4,   38,   37,   24,   22,   39,   32,   24,   24,   25,
         18,   33,   19,   20,   28,   25,   26,    1,    7,   -9,   11,
         10,   -7,    9,   -6,    8,   11,    7,   -2,    3,   -5,   -7,
         -4,  -13,   -9,    8,   14,   -4,   -3,   -8,    3,    5,   16,
         17,   -1,   11,   -1,    6,   -3,    4,   16,    8,   11,    8,
         12,   14,    7,   17,    9,   16,    8,   -7,   22,   18,    9,
          6,    6,  -22,  -11,  -16,  -57,   -7,  -11,  -11,    5,   -7,
        -10,  -26,  -67,  -14,  -22,   44,   42,   37,   23,   47,   42,
         38,   30,   41,   25,   25,   35,   42,   38,   30,   29,   10,
         18,   14,   11,    1,    9,    6,   21,   19,   -8,    8,   15,
         16,   20,    9,   13,    9,   26,   13,    0,    2,    8,   11,
          7,    4,    6,   -5,   14,    7,   15,    0,    6,  -73,  -94,
        -48,  -24,  -64,  -94,  -47,  -58,  -59,   54,  -32,  -41,  -51,
        -78,  -42,  -40,    9,   -3,   10,   17,   11,    5,    2,    3,
         -7,   12,   17,   16,    2,   -8,   15,   10,    3,   -3,    9,
         -9,   11,    5,   -7,    1,    3,   -2,  -10,   -8,   -8,  -10,
         -9,   11,   -8,  -10,    5,    6,   -1,   -1,   -5,   14,   -8,
          3,   -8,   14,   -1,   -1,    2,    0,   23,   30,   32,   28,
         36,   25,   17,   34,   34,  -16,   22,   18,   32,   25,   21,
         21,    3,    3,    6,   11,    7,    6,   14,    5,    1,    1,
         17,   15,   15,    6,   16,   17,  -12,  -21,  -13,   -2,  -18,
        -53,    3,   -3,   -1,   35,  -12,    2,  -42,  -79,  -21,    2,
          7,   13,    0,   28,   19,   12,    8,   16,   -1,    5,    8,
         17,    5,   18,    1,   23,    8,    2,    9,    5,   -3,   15,
          1,   14,   -4,  -15,    0,   12,    4,   10,    1,   -1,   -3,
         -3,   -2,   18,    8,   -2,   -7,    7,    1,   12,   10,    2,
         -4,    0,    5,   14,   -4,    1,    3,    6,    4,    3,    2,
          0,   10,   17,   10,    9,    8,   -4,    0,   -2,    1,  -12,
         -7,    5,    7,    2,    4,   11,    4,   11,   14,    0,    6,
         -1,   11,   -3,    3,  -11,   -6,    9,   -6,    5,   10,   -1,
          3,   11,   16,   -8,   10,   10,    5,   14,    2,   10,   -2,
         -8,    9,    8,   -3,   -1,   10,   10,   11,   11,    3,    1,
         -6,   11,  -15,   -7,   -1,    7,   -5,   -8,   -6,   -1,    9,
          0,    3,    7,   -2,  -20,    8,    8,    6,    0,    9,    8,
          4,   -9,   -2,    5,   -3,   -9,    0,   13,   10,   -9,    8,
          6,   30,   38,   23,   32,   29,   30,   23,   18,   17,   44,
         19,   14,   12,   26,   30,   38,   -2,    9,   -7,   -9,   -9,
         -9,    9,   14,  -13,   -2,    6,   -5,   -9,   -1,   -6,   -2,
         -8,   -4,   -1,    2,   -4,   -5,   -6,    6,    6,  -10,    4,
          7,   -3,   -1,    9,    5,    4,    8,    8,   -2,   -3,  -10,
         -4,   11,   -7,    1,    8,   12,   -8,    6,   -3,   15,   16,
         15,   19,   25,    1,   -4,   15,   12,    8,   11,    2,   -1,
         26,   -3,    8,   13,   -6,   -5,   15,    4,    2,  -11,   12,
         11,    7,  -17,   11,    3,    6,   18,   13,   10,   18,   24,
         22,   22,   41,   18,   29,   24,   24,   -9,   16,   15,   28,
         20,   11,   25,    6,    1,   -5,   -3,   -4,   -8,   12,   15,
         -4,   11,    0,    0,   12,   12,    0,    8,   -3,   -4,   -6,
         -3,  -10,   -4,   -6,    4,   -1,   -8,    1,    7,    3,   -5,
        -10,    9,  -32,  -34,  -20,  -11,  -34,  -41,    1,  -10,   -6,
          8,   -6,    7,  -20,  -43,  -34,    0,   64,   56,   67,   52,
         63,   65,   57,   62,   64,  -38,   56,   64,   62,   70,   52,
         60,   -6,   -3,    1,   10,    9,  -10,   -1,    8,   -1,   13,
          1,   -2,   -4,    6,   11,   -4,   -9,   -8,    0,    1,    9,
          1,    3,    7,    0,   18,   10,    2,    5,    6,    3,    6,
         83,   78,   76,   62,   61,   80,   79,   66,   82,  -31,   81,
         63,   79,   60,   73,   85,    0,   -5,   -4,   10,   -9,  -10,
         -3,    1,    4,   -5,   13,   14,    1,  -11,   -1,   13,    5,
        -12,   -2,    9,    4,   -8,    6,   -7,    2,   -6,    4,    6,
        -10,   -8,  -10,    0,   10,   15,   24,   19,   16,   14,   17,
          6,    9,   22,   20,    9,   14,   -2,    8,    6,    3,    5,
          9,    1,   -2,   -4,   10,    5,    8,  -15,   15,    5,   -3,
         -3,   -2,    8,   -9,    4,    9,   -3,   -7,    3,   -2,   -6,
          1,  -10,    8,   11,    4,   11,    9,    4,   45,   41,   28,
         30,   21,   25,   38,   17,   38,    4,   23,   32,   25,   19,
         24,   22,   25,   22,   28,   27,   38,   20,   29,   19,   40,
         -3,   30,   20,   31,   27,   29,   22,   -2,    7,   -5,   17,
          9,    7,   -3,   22,    1,   14,   16,   -3,   11,    3,   16,
         13,    6,    8,    3,  -10,  -11,    9,   -8,   -7,    4,   -6,
          4,    9,   -1,    3,  -11,    1,   48,   51,   40,   29,   39,
         57,   38,   25,   45,  -23,   43,   27,   29,   30,   48,   36,
          8,    6,   -1,    9,    4,   10,    3,    6,   14,    1,   -2,
          4,   -7,   -4,   -1,    5,    4,    8,    5,   -7,   -5,  -12,
         14,   15,   -4,   14,   13,   12,   -2,   -2,   -1,   18,    1,
        -12,    4,    3,   -4,  -13,    8,    5,    8,   -4,    9,   12,
         -7,   -9,    3,   -7,   13,   10,   -6,    2,    4,    9,    2,
         12,   -1,   -9,    4,    4,   -7,   -5,   -4,    5,   -5,   10,
         -8,    5,    5,    0,   -3,    2,    5,   10,    5,   -2,  -10,
          1,    9,    9,   -1,   10,   13,    5,   11,    8,   -6,    0,
         16,    2,    4,   14,    6,    8,   13,    3,  -21,  -25,  -20,
        -12,  -25,  -48,  -21,  -21,  -11,    7,   -3,   -2,  -29,  -80,
        -47,  -11,    4,    0,    6,   -6,   -6,    6,    5,    0,   -2,
          6,    0,    1,   -6,   -9,  -11,   -5,    8,    5,   -7,    6,
         11,   -2,    2,    7,    2,    8,    6,    8,    9,    8,    9,
        -11,   -3,   -5,  -12,   -3,  -14,  -15,   -3,    2,    5,  -10,
        -12,   -4,  -14,  -28,  -15,   -5,    4,   11,    1,    7,   -3,
         12,    2,    3,   -5,   17,   -8,    0,    4,   -2,   12,   -5,
          9,   -3,    5,   -2,    1,   -3,   -9,    8,    9,   10,    7,
          3,   -3,   -2,   -7,  -10,   16,    6,   -2,   10,   10,    3,
          2,    2,   -3,   25,    7,   10,    2,   11,   11,    6,  -29,
        -32,  -29,  -10,  -32,  -84,  -16,  -24,  -16,   20,  -22,  -20,
        -50,  -93,   -2,  -28,   -5,   -4,    5,    1,   -7,   -5,   -3,
         -3,   -7,  -19,    1,    6,    3,    9,    7,   -1,   32,   40,
         41,   37,   33,   40,   32,   27,   32,   18,   40,   35,   32,
         30,   37,   38,   -3,    0,   12,    9,   -9,  -12,   17,    0,
         -4,    3,    0,    2,    2,  -16,   -5,    7,   -1,    4,    6,
         -4,   -7,   -2,    4,    6,    3,  -22,    7,   -2,   -3,   -2,
         -6,    4,   10,    6,   10,    8,   11,    2,   14,   10,    0,
        -24,   24,    7,    1,   11,    9,   13,  -15,  -10,   -7,    4,
          8,   -9,    2,   -6,   14,    7,   -3,    7,   -3,    4,   11,
         11,    8,   11,    7,   20,   10,   12,   22,    5,   11,   -5,
          8,   25,   14,   14,   17,   15,   -7,    4,   -2,   11,   -2,
         -1,    3,   16,    9,   22,   18,   -4,    0,   -3,    9,    0,
         26,   15,   36,   20,   26,   33,   30,   32,   34,  -53,   31,
         20,   23,   24,   34,   36,   -1,    0,    1,    5,    8,   -2,
          6,    3,   -8,    0,    9,   -4,   -9,  -10,   -6,   -6,   -9,
         -4,   15,   15,   -1,   -2,   10,    3,   -4,   12,   -2,   -1,
         12,    1,   12,   -3,   -7,   -3,   -5,   -4,  -20,   -9,    3,
          9,    7,   -2,    3,   -8,    2,   -7,   -4,  -14,  -39,  -64,
        -33,  -24,  -36,  -47,  -35,  -21,  -23,   22,  -24,  -25,  -55,
        -98,  -51,  -28,    3,  -11,   -3,  -10,    1,   -6,   -7,    8,
        -10,   -8,    9,   10,   -9,    1,   -5,   -9,   -1,   -9,    5,
         10,    0,   -6,    9,   13,   -6,    9,   10,    1,   -6,   -4,
         10,    7,   -8,    6,   -4,    9,   -7,    2,   13,    4,    5,
         -8,   -7,    3,   11,    2,   12,   -8,   -4,    3,    1,    1,
          6,    6,  -10,   -5,  -10,   -6,   -5,    7,   -2,   10,    0,
         -3,   -1,   13,   -1,    7,    5,   -2,   -1,   17,    1,   -1,
         13,   10,    7,   -9,   14,   -6,   -4,   -3,    6,   13,   -4,
          1,   -7,    8,    6,   17,   10,   12,   12,   -3,    6,   16,
